[
  {
    "text": "Happy New Year my baby boy 🤭🩷\nAs I look back, we've grown a lot as a couple this year, we fought we fixed we stayed.\nLast year this day I was really convinced that I don't matter much to you but as time went by I came to realise that being the first one to wish on new year doesn't really define my importance in your life, if doesn't state whether you're going to be the person who sticks around throughout the year. So this year I won't expect that from your end but yes I'm more into such things (I've made it pretty obvious by now 😶‍🌫️) that is why I'm writing it here!\n\nI wish and pray that God listens to your prayers, you lead an even healthier life this year, I wish and pray you get to achieve all of that you've wished for Umair.\nI pray that God keeps you safe from everything that comes in your way (even if it's me) 🥺\n\nI pray that we both grow even more in love and patience and understanding.\nI pray that we make past this year too and many more that's to come.\nI LOVE YOU UMAIR 🩷",
    "image": "new_year.jpg",
    "category": "reasons",
    "created": 1769519785716381
  },
  {
    "title": "We enter 2026 together! ",
    "text": "Happy New Year my baby boy 🤭🩷 \nAs I look back, we've grown a lot as a couple this year, we fought we fixed we stayed. \nLast year this day I was really convinced that I don't matter much to you but as time went by I came to realise that being the first one to wish on new year doesn't really define my importance in your life, if doesn't state whether you're going to be the person who sticks around throughout the year. So this year I won't expect that from your end but yes I'm more into such things (I've made it pretty obvious by now 😶‍🌫️) that is why I'm writing it here! \n\nI wish and pray that God listens to your prayers, you lead an even healthier life this year, I wish and pray you get to achieve all of that you've wished for Umair. \nI pray that God keeps you safe from everything that comes in your way (even if it's me) 🥺\n\nI pray that we both grow even more in love and patience and understanding. \nI pray that we make past this year too and many more that's to come. \nI LOVE YOU UMAIR 🩷\n\nHAPPY NEW YEAR MY UMZYPIE PLUM PUDDING 🤭",
    "created": 1767199317774000,
    "labels": [],
    "category": "all"
  },
  {
    "title": "",
    "text": "I very love you\nMore than the stars at night \nMore than the sky with its huge blue clouds \nMore than the moon which shines bright with light \nMore than the noise from big huge crowds \nNo matter all the things we go through \nJust remember I got you and I very very VERY love you",
    "created": 1758801305783000,
    "labels": [
      "Poems 🖇️",
      "HER 🩷"
    ],
    "category": "poems"
  },
  {
    "title": "",
    "text": "Do you really think that I'm worthy enough to fight for?\n\nRE: \n\nOBVIOUSLY \n\nEXACTLY \n\nACTUALLY \n\nDEFINITELY \n\nLITERALLY \n\nABSOLUTELY\n\nCERTAINLY\n\nUNDOUBTEDLY\n\nSURELY\n\nPOSITIVELY\n\nCLEARLY\n\nTRULY\n\nINDEED\n\nOF COURSE\n\nWITHOUT A DOUBT\n\nBEYOND QUESTION\n\nUNQUESTIONABLY\n\nINDUBITABLY\n\nVERITABLY\n\nGENUINELY\n\nWHOLEHEARTEDLY\n\nFOR SURE\n\nASSUREDLY\n\nCONCLUSIVELY\n\nIRREFUTABLY\n",
    "created": 1755933365810000,
    "labels": [
      "Notes 👉🏻👈🏻"
    ],
    "category": "notes"
  },
  {
    "title": "",
    "text": "I'm so sorry Umair tmko bhookhe sona padh rha hmko kbhi ni lga tha ki woh letter se itna kuch ho jayega varna hm kbhi ni mange hote hmko bilkul achha ni lga hm hm sb mera galti h tmko maare kyu yaar yeh kitna galat hai hmko yesb se bahut darr lgta hai please hmko chor kr mat jana hm kbhi gussa ni krenge na jhagra krnge I'm so sorry for everything you didn't deserve all of this hm sb thik kr denge I'm not asking you to go against your parents but hm bahut pyar krte hai tmse Umair please aise mat jao tmhare bina ni reh payenge tm kehte the ki meri smile tmhare liye zaruri h so please don't take that away hmko maaf krdo hmko tmhare sath hi rehna hai hm tmko hame\n\nRE:\nIt’s not your fault suvi hmein khud hi likh lena chahye tha apke kahe baghair and pkda jana that was my fault yaar I am so sorry I put you through that It was a hard time for both of us and I am to blame for that I was reckless in keeping that safe but ap na hon preshan hm nhi ja rhe apko chod ke kahin bhi I love you so much aur believe me Suvi hm chodna bhi nhi chahte yaar pr kese krenge ye sb hmein smjh hi nhi araha 😭😭😭 and pleaseee keep smiling Suvi for me hmein bhi apke sath hi rehna hai 🥺\n\n\nWe'll make a way to each other and God will help us through it. 😔",
    "created": 1755892944089000,
    "labels": [
      "Notes 👉🏻👈🏻"
    ],
    "category": "notes"
  },
  {
    "title": "",
    "text": "Do I miss your smile,\nOr the way you say my name?\nDo I miss your soft “goodnight,”\nOr the way you play our game?\n\nDo I miss your laugh,\nOr the spark inside your eyes?\nDo I miss your gentle love,\nOr the way you kill my goodbyes?\n\nMiles can’t hide it,\nSuvi, you’re still my home,\nAnd every night without you\nFeels like I’m all alone.",
    "created": 1754506205087000,
    "labels": [
      "HER 🩷"
    ],
    "category": "all"
  },
  {
    "title": "HER 🩷",
    "text": "You told me you’re not okay and yeah that’s on me\nI said something I shouldn’t’ve I didn’t think, didn’t see\nNow I’m here trying to fix what I broke\nTalking dumb saying sorry between every joke\n\nAnd yeah I ask for a pic I always do\nNot just to see you but to see if it’s you\nLike are you really okay or still hurting inside?\nThat smile tells me more than whatever you hide\n\nI don’t write much guess that’s pretty clear\nBut your smile’s the one thing I want near\nIt’s warm, it’s bright, it’s all I see \nAnd damn it means the world to me\n\n",
    "created": 1754328340187000,
    "labels": [
      "HER 🩷"
    ],
    "category": "all"
  },
  {
    "title": "My Love",
    "text": "I’m not great at this kind of thing,\nWriting stuff, not really my thing \nBut Suvi I have been thinking a lot \nAnd there’s stuff on my chest that I gotta get off\n\nI know I have hurt you more than once\nSaid dumb things acted like I had no sense\nI hate that I made you feel low \nAnd If I could undo it, you already know\n\nI am not here with lines or big plans to say\nJust that I don’t want to walk away\nYou matter Suvi you really do \nAnd I still choose us I still choose you",
    "created": 1754322386745000,
    "labels": [
      "HER 🩷"
    ],
    "category": "all"
  },
  {
    "title": "I love seeing you in love with me 🥺",
    "text": "I've always said that I love you a lot because of several reasons  but I've never once mentioned how much I love watching my man being so protective, loving and caring for me and being so madly in love that it does reflect when you speak, your soul seems happy, it screams contentment and joy, and I love that feeling of making you feel the happiest!\n\nI wish that I continue to be the reason behind your happiness 🥺🩷\n\nI love to see you in love 🩷",
    "created": 1751134456191000,
    "labels": [
      "Notes 👉🏻👈🏻"
    ],
    "category": "notes"
  },
  {
    "title": "",
    "text": "Hey there Umair! 🥺\n\nLike you said, the bond which we share is special, it doesn't come easily to everyone. Sometimes life gives us something so rare and beautiful that it almost feels unreal (especially after we've had gone through a lot in the past.) That’s what you are to me. 🥺\n\nI know things haven’t been perfect. We’ve had moments of doubt, anger, anxiety, overthinking, and tears. But despite that, one thing remains clear in my heart that I love you. And I’m not giving up on us. \n\nRelationships aren’t easy, especially for me that too when distance, differences, and fears come in the way. But I believe that if two people are willing to try, like really try, then love can still win. And I am willing. I want us to keep choosing each other, even on the days it feels hard. 🥺 \n\nLet this be a reminder for both of us, We’re not alone in this. We’ve got each other, and more importantly, we’ve got God walking with us through every challenge and every beautiful moment. So let’s be patient. Let’s be honest. Let’s heal where it hurts and grow stronger together. \n\nWe may not have all the answers now, but we have a chance, and that’s something worth holding on to.🩷\n\n\nHere's a Prayer for Us 🤧\n\nHeavenly Father,\nWe come before You with open hearts, asking You to bless our relationship. Be the center of our love, the healer of our wounds, and the guide for our future. Strengthen the bond we share and help us trust each other the way You call us to. Teach us to love with grace, to forgive quickly, and to communicate with gentleness and truth.\nIf this relationship is Your will, Lord, then help us protect it, nurture it, and grow within it. And if we ever lose our way, please show us the path that leads back to You and to each other.\nIn Jesus’ name, Amen.\n\n\n",
    "created": 1750245754857000,
    "labels": [
      "Notes 👉🏻👈🏻"
    ],
    "category": "notes"
  },
  {
    "title": "I love you my baby umzy 🐶🥺🩷",
    "text": "Just a reminder for you that you're sooooo cute my baby boy 😩🩷 \nLike all the time!!!! Just seeing your snap or listening to your voice makes everything so much better! 🥺 \n\nI'm so lucky to have you by my side, I love you so so much Umair. 🥺🩷\n",
    "created": 1749406201320000,
    "labels": [
      "Notes 👉🏻👈🏻"
    ],
    "category": "notes"
  },
  {
    "title": "Reasons why Suvi can grow distant and you could lose her 💔",
    "text": "You expect her to understand your side when you don't even try to understand her's. \nYou make her feel unheard and unloved, a lot of times that too! \nYou don't express yourself when she's wants that the most. \nAt times you make her feel that it's just lust from your side and not love. \nYou expect things to go back to normal without even apologizing properly (only saying sorry doesn't count in as apology).\nYou make her feel unimportant. \nYou make her feel that she'll never be your priority.\nThe way you treat her at times, makes her feel you'd never take stand for her in the future. \nYou don't even make an effort to make a phone call when it's needed.\nYou make her feel that she's only loved when you're turned on, well then that's not love !! \nYou say that you love her a lot but your actions speak otherwise. \nYou say you'd never want to hurt her but you end up doing that always! \nYou use your situation as excuses most of the times. \nYou're certainly not perfect but even when she tries seeing you that way, you give her a million reasons not to! \nThere are times you make her feel that she isn't a part of your routine.\nYou behave as if you're okay without talking to her the whole day. ",
    "created": 1748626986142000,
    "labels": [],
    "category": "all"
  },
  {
    "title": "",
    "text": "You're literally the calmest person I've ever come across, YOU'RE!!! atleast with me 🥺 We've been together for long time now, and never have you once raised your voice infront of me 🤧 I love how you sound while talking to me, it's just so relaxing listening to your voice especially when you're all lovey dovey 🤭 \nAnd the fact that only I get to see this side of yours, makes me feel that I'm the luckiest girl on this planet 😭🩷\n\nI feel soooooo at peace when I see you trying your best for us 🥺🩷 I love you Umair.😭",
    "created": 1748092682076000,
    "labels": [
      "Reasons ❤️‍🩹"
    ],
    "category": "reasons"
  },
  {
    "title": "",
    "text": "Your calmness (with me) has to be the no. 1 reason why I love you this muchh! The way you handle my nakhare and nataks, that too so calmly... is something that makes my heart melt! 😭 \nI love how you're never rude to me even when I test your patience 😭🩷",
    "created": 1748092409440000,
    "labels": [
      "Reasons ❤️‍🩹"
    ],
    "category": "reasons"
  },
  {
    "title": "",
    "text": "I love how you're so consistent with things, not just our relationship but with your work, your things, you make sure to handle everything...that's something which shows your dedication towards something you put your heart,mind and soul into, and I really want to learn that quality of yours! 🤧🩷 ",
    "created": 1748092408907000,
    "labels": [
      "Reasons ❤️‍🩹"
    ],
    "category": "reasons"
  },
  {
    "title": "",
    "text": "You understand me in ways, no one ever did! \nYou make me feel like you're my person...You get me when I don’t even make sense. That's one more reason I keep falling for you more and more day by day. 🥺",
    "created": 1748092395170000,
    "labels": [
      "Reasons ❤️‍🩹"
    ],
    "category": "reasons"
  },
  {
    "title": "",
    "text": "You care about me, about my feelings and you do your best not to hurt me! \nYou've been trying a lot to change yourself for me, for us, and that's what really matters and makes me proud and happy for having been blessed with someone like you! 🥺🩷",
    "created": 1748092389338000,
    "labels": [
      "Reasons ❤️‍🩹"
    ],
    "category": "reasons"
  },
  {
    "title": "",
    "text": "All my life I've had major trust issues and you're the only person who has been able to gain my trust to this extent and made me believe in love! The kind of love which makes me feel at ease! And that too despite the distance between us. 🤧🥺 \n\nYou've always been honest about your feelings without any fail and I'd be an idiot if I refuse to admit that this too has been a reason why I can't stop loving you more and more by each passing day.🥺🩷",
    "created": 1748092382525000,
    "labels": [
      "Reasons ❤️‍🩹"
    ],
    "category": "reasons"
  },
  {
    "title": "",
    "text": "Though we've been in a couple of arguments before you've always come back to me, you believe in us and you believe in God, that with prayer and patience hopefully we'd make it. 🥺\n\nI like that you've promised, that you won't give up easily on us and I'll do the same, cause WE HAVE TO END UP TOGETHER UMAIR! 😭🩷",
    "created": 1748092355389000,
    "labels": [
      "Reasons ❤️‍🩹"
    ],
    "category": "reasons"
  },
  {
    "title": "",
    "text": "Ooh don't even get me started I'm in love with your smile, 😩🩷 yes I might not mention it a lot, cause your eyes and your voice takes away most of the credit but I really love to see you smiling 🤭\n\nThe first time I saw you smiling infact laughing was in those videos where you and your friends were singing, that was the 2nd time I fell in love with you all over again 🥺😭🩷",
    "created": 1748092355163000,
    "labels": [
      "Reasons ❤️‍🩹"
    ],
    "category": "reasons"
  },
  {
    "title": "",
    "text": "I'm so proud that I chose you, you're very well raised. I don't know how you're with other people, but with me, not once I've felt unsafe or unheard, you've treated me right ever since I've known you! \n\nI'm literally the happiest because of you Umair. 🩷",
    "created": 1748092338597000,
    "labels": [
      "Reasons ❤️‍🩹"
    ],
    "category": "reasons"
  },
  {
    "title": "",
    "text": "The fact that you trust me and feel safe with me which allows you to be comfortable around me and share all your thoughts, has been one of those reasons why I started trusting you a lot more, because as far as I know, it's not easy for men to express themselves but you've done that with me 🥺\n\nAnd I really feel at ease, knowing that I am that important to you.🥺",
    "created": 1748092319348000,
    "labels": [
      "Reasons ❤️‍🩹"
    ],
    "category": "reasons"
  },
  {
    "title": "",
    "text": "God I don't know where do I start from 😭 I've said it a thousand times before and yet would say again I'M LITERALLY IN LOVE WITH YOUR VOICE UMAIR 😩🩷\n\nEver since the day we started talking, I've liked your voice but now it has a different kind of affect on me 🥺 your voice... it has the power to lift up my mood, to calm me down, to make me feel at ease, to make me wet, everything!!!!! 😩😭 \n\nOh how do I explain it to you, there are times when I act a bit weird and that's when I want to listen to your voice the most 🥺 I love hearing to you 😭🩷",
    "created": 1748091846591000,
    "labels": [
      "Reasons ❤️‍🩹"
    ],
    "category": "reasons"
  },
  {
    "title": "",
    "text": "Ever since we started talking you never played hard to get, we never came across \"Why should I text first\" phase. Instead you've texted me whenever you could, phele toh I misunderstood a lot of things but now I know it all 🤧 And I'm so sorry for all those times.\n\nI feel so happy whenever I receive your texts saying you love me or miss me, or asking me my whereabouts especially when you're busy with things, it makes me feel that you haven't forgotten about me, I'm still there 🥺 And I just love you Umair 😭🩷",
    "created": 1748091846167000,
    "labels": [
      "Reasons ❤️‍🩹"
    ],
    "category": "reasons"
  },
  {
    "title": "",
    "text": "I like how you keep your words, I don't expect from you to make any big promises but I've seen how you make sure to keep the small ones 🤧 \nI don't have to remind you twice of things I don't like or something I wanted you to do for me 🥺 \n\nYou make sure that I'm heard and that's more than I can ask for! 🥺🩷",
    "created": 1748091837699000,
    "labels": [
      "Reasons ❤️‍🩹"
    ],
    "category": "reasons"
  },
  {
    "title": "",
    "text": "How do you even manage to be this patient with someone like me!? 😭 \nI mean I know how irritating I behave at times 😭 but you still bear with it and not just that you try to understand the reason behind my behaviour, you try to fix it and all of that shows how genuine your feelings are for me. 🥺 \n\nThank you Umair, for trying for me 🥺🩷",
    "created": 1748091716533000,
    "labels": [
      "Reasons ❤️‍🩹"
    ],
    "category": "reasons"
  },
  {
    "title": "",
    "text": "I really like how you show your willingness for us to end up together. Despite the uncertainties, you act so sure about us.(As in about us being happy and content together). There were times when I used to think it was all just flattery, but over time, you've made me believe in the love you have for me.🥺\n\nI hope and pray for your dreams about us to come true cause I really need you by my side. 😭🩷",
    "created": 1748091578559000,
    "labels": [
      "Reasons ❤️‍🩹"
    ],
    "category": "reasons"
  },
  {
    "title": "",
    "text": "When you remember small details 🥺 when you're interested in my unnecessary yapping...where I keep complaining about my life, my friends, my relatives or my colleagues 😭 \nWhen you show interest in my things which has nothing to do with you 🥺 \nWhen you send me voice notes even when someone might hear you 🤧 when you make sure to update me 🥺 when you try to call or text me even when you're with your friends 😭 when you listen to my each and every request 🥺🩷 you've never said no for anything that I've asked 🥺 there are a lot more, which I'm not able to recall at the moment and I'm so sorry for that 🤧\n\nGod! How did I even manage to pull someone like you 😭🩷 you're the best my love 🥺 ",
    "created": 1748091486979000,
    "labels": [
      "Reasons ❤️‍🩹"
    ],
    "category": "reasons"
  },
  {
    "title": "",
    "text": "You never believe this, but the way I find you attractive, I've never seen anyone like that before 🥺\nYou're literally a treat to my eyes 😭 Aah! that reminds me of YOUR EYES, just one look and I'd even believe in your lies 😭 that's how impactful they're 😭 Your kissable lips 😭 I so want to know how they'd taste 😭 OML you even got a perfect nose😭😭 And on top of all this...YOU'RE TALL 😭 \n\nI wonder how will I even look into your eyes when you're up close 😭",
    "created": 1748091476818000,
    "labels": [
      "Reasons ❤️‍🩹"
    ],
    "category": "reasons"
  },
  {
    "title": "",
    "text": "You're so good with words, earlier I used to think that you didn't mean any of it, but eventually after I started knowing you inside out, I realised that it's just your way of expressing your feelings for me 🤧\n\nEven now I call you out saying \"dialoguebazzi kam\" but I like it 🤧 I just keep on pretending but I really like listening to you say all of that 😩🩷",
    "created": 1748091287218000,
    "labels": [
      "Reasons ❤️‍🩹"
    ],
    "category": "reasons"
  },
  {
    "title": "",
    "text": "I love when you show this side of ours, it feels like you know that I belong to you and you want that what's yours, it's taken care of! 🤧\n\nEarlier I wasn't like this, I didn't like giving or receiving updates or being babied 🤧 but with you I want to be taken care of, to take care of you as well 🥺 \n",
    "created": 1748091279142000,
    "labels": [
      "Reasons ❤️‍🩹"
    ],
    "category": "reasons"
  },
  {
    "title": "",
    "text": "I used to think I'm the most optimistic person until I met you 👀 The kind of energy you give off is the kind I was always looking for! 🤧\nYou make life seem so easy, like we do have problems but you make me feel that it's okay, things will get better, you'll be there with me, to listen, to help, to not judge, to support me 🥹 and I feel so blessed having you by my side! 🥺🩷\n",
    "created": 1748077042673000,
    "labels": [
      "Reasons ❤️‍🩹"
    ],
    "category": "reasons"
  },
  {
    "title": "",
    "text": "I like how you're keen to always know about things, I'm not like that 🥹 I mean I can't sit there and watch an informative video 😭 but you do that and I'm sure it helps in many ways. (I'll try to become more like you) 🤧\nYou always try to do better not just in your studies and work, but also in our relationship you've been trying a lot to make things better between us and I really appreciate those efforts Umair. 🥺🩷",
    "created": 1748076957428000,
    "labels": [
      "Reasons ❤️‍🩹"
    ],
    "category": "reasons"
  },
  {
    "title": "",
    "text": "I love how you love me 😭 and you're vocal about it, you never played games, never played hard to get, you've always said it out loud that how much you're into me! 🥺 \nI never thought a man could be this expressive, and I never knew that it would make me fall so deeply in love with you 🥺 it's like your love is a need for me now 🤧 cause for a fact I just know that I'd never find someone as loving as you are! 🥺🩷",
    "created": 1748076880902000,
    "labels": [
      "Reasons ❤️‍🩹"
    ],
    "category": "reasons"
  },
  {
    "title": "In captial letters 🎀",
    "text": "\n\"What is love?\" they ask.\nI simply say His name—in capital letters.\n\n\n\"How could someone so far matter to you this much?\" they ask.\nI say, he's far, yet the warmth of his love wraps me tighter than my favorite sweaters.\n\n\n\"What is it that you find so attractive in him?\" they ask.\nIs it his eyes, his smile, his voice?\nOr the way he's never tired of saying how he feels for me?\nThe way he shows me, every day, how grateful he is to have me?\nNo single answer would suffice, because with him, it only gets better.\n\n- Suvi \n",
    "created": 1746935781326000,
    "labels": [
      "Poems 🖇️"
    ],
    "category": "poems"
  },
  {
    "title": "HIM ❤️",
    "text": "His pretty brown eyes\nAre enough to make me believe all of his lies.\n\nHe doesn't even know what his voice does to me;\nButterflies aren't enough—I feel the whole damn zoo, you see!\n\nHis smile is as beautiful as those constellations,\nKeeping me entangled in my fanciful imaginations.\n\nHow I wish I could run my fingers through his hair!\nLittle does he know how desperate I am to breathe the very same air,\nthe air he's breathing. How do I tell him we'd make such a beautiful pair?\n\n— Suvi ",
    "created": 1746935781325000,
    "labels": [
      "Poems 🖇️"
    ],
    "category": "poems"
  },
  {
    "title": "In sync with you. ",
    "text": "You walked into my life when I least expected love,\nLittle did I know you'd make me wanna cross borders when push comes to shove!\n\nI found you interesting as our interests kind of matched,\nWhile I always knew it would get me into trouble if we happened to get attached!\n\nBut they say love never comes with a warning!\nSo here I am, daydreaming of ways to cross a wiring!\nFunny how delusional I sound most of the time,\nBut then I picture a life with you—peaceful as church bells chime.\n\nIt's kinda weird how we talked for hours that felt like a blink,\nOh! I love how you express every bit of emotion you feel for me like it's in sync.\n\nNow you've become a part of my daily prayers,\nHope we make it past time, past trials—love that never wears.\n\n— Suvi ",
    "created": 1746935781302000,
    "labels": [
      "Poems 🖇️"
    ],
    "category": "poems"
  },
  {
    "title": "Feels like a dream come true! ",
    "text": "I saw a dream about you!\nShould I think of it as a cue?\nA cue which tells me that we should make it come true,\nYes, the dream which was all about you!\n\nI saw myself melting in your arms,\nEven if it was just a dream, I couldn't resist all your charms!\n\nThe eye contact which we had,\nSpoke more than words, made me feel so glad! \n\nThe moment when you held me,\nTo tell me how much you love me,\nI was just about to look deep into your eyes and say,\nThat I felt the same in every way.\n\nBut as I said, it was just a dream,\nSomeone woke me up—it felt so mean!\n\nPulled away from a world so divine,\nWhere your heart felt perfectly aligned with mine.\n\nIf only dreams could turn to reality,\nI'd find you and make this destiny.\nThe kind of destiny which won't have any borders,\nWhere love flows freely, crossing all orders.\n\nNo distance would feel too far, no time would feel too long,\nWith you by my side, my world would feel so strong.\n\nTogether, we'd shape a life so true,\nJust like this dream, only me and you! \n\n— Suvi.\n\n\n",
    "created": 1746935780979000,
    "labels": [
      "Poems 🖇️"
    ],
    "category": "poems"
  },
  {
    "title": "Open when you want to feel close to me.",
    "text": "I hope you come here every once in a while 🫣 I mean I'd love when you'd want to feel close to me, it gets very hard at times to control the urge of being together physically but there are times when we grow emotionally distant, and that's when I want you to be here the most, to remind you that even when you feel so I'm (and I should be) the closest person in your life 😭 \n\nEven when we get busy and aren't able to talk much, I want you to know that I'm here whenever you need me, all you need to do is be there, still!! And your suvi will give you all the love you deserve! ",
    "created": 1746799938593000,
    "labels": [
      "Letters 💌"
    ],
    "category": "letters"
  },
  {
    "title": "Open when you're bored.",
    "text": "There are times when things feel a bit stagnant and I guess that's what has happened today 👀 which made you come here 👀\nSometimes even between us, our conversation feels monotonous so maybe you could get bored. But I want you to remember and acknowledge the fact that time mends it all, with little effort and patience we can overcome this phase for both of us 🥺 \nWhat matters is we both are in love with each other and we're not giving up no matter what 🤧",
    "created": 1746799938234000,
    "labels": [
      "Letters 💌"
    ],
    "category": "letters"
  },
  {
    "title": "Open when you're feeling insecure.",
    "text": "First of all you're not allowed to feel that way 😒\nBut then again if you're here then you're going through that feeling which makes me really upset 😕\n\nI wish I could show you how perfect you're in many ways, you ask what do I like in you, right? \nSo I've had male classmates/friends/colleagues all my life and I've had interaction, after most of the conversation which I've had left me wondering \"seriously yeh aise sochta hai!?\", and till date there hasn't been a single conversation which made me feel like that about you even though when we both come from different cultural backgrounds, have different set of upbringing yet you always gave me the vibes, I always wanted in my partner 🤧 \n\nNot just that, you're so well behaved 😭 you've never raised your voice infront of me, you're such a sweetheart 😭🩷\n\nHave you seen yourself!!? Your eyess 😭😭 they're the prettiest eyes I've ever seen 😭 your voice toh ufff 😭 I'm literally in love with your voice 🥺 \nYour hairs, your lips, your smile 😭🩷 you even got a perfect nose and still you have the audacity to say \"bs awein kehti hai aap\" 🥹😏\n\nI don't know about others but you're perfect to me! yes I do get angry but that doesn't mean that I stopped seeing you that way 😭 \nI love you so much you're the best and your mommy's so proud of you babyboi! 🤧🫣",
    "created": 1746799910792000,
    "labels": [
      "Letters 💌"
    ],
    "category": "letters"
  },
  {
    "title": "Open when you're craving a kiss.",
    "text": "Look who's here 👀\nI know that you've a pretty girlfriend and you might want to kiss her every single minute, don't you? 😬🤧😂\nWell as we're far we can just kiss eachother through our phone screen, which.. we do most of the times after seeing eachother's snaps! That's mostly a cutesy kiss out of pure love but but but there are also such times when we really crave for a KISS, the kind of kiss which would leave us breathless 🫣 the kind of kiss which wouldn't allow us to keep our hands to ourselves, the kind of kiss which we might start slow but end up sucking eachother's tongue which would later lead to sucking...okay okay I won't go there 🫣 so just thinking about this turns me on wonder what'd happen to me when this actually happens 😭 \n\nIf you're here then talk to me, tell me how much you crave for me, trust me, I love that the most 🤧🫣\n\nI love you and I TOO WANT TO KISS YOU SO BAD 😭\n",
    "created": 1746799910768000,
    "labels": [
      "Letters 💌"
    ],
    "category": "letters"
  },
  {
    "title": "Open when it's our anniversary.",
    "text": "I hope and pray that we make it till here 🥺 And if you're here then Happy Anniversary to us. 🩷\n\nWe may not have met, may not have shared moments together in person like other couples do but we're happy in our own way, we've seen so many trials, either due to time, distance, trust issues or uncertainty still we ended up choosing each other.\n\nSometimes, I wish things were different, that I could hug you, surprise you with something simple, or just sit beside you in silence. But even without those moments, I’ve felt so seen, so understood, so loved by you. And that’s what matters most.\n\nOn this October 10th, I want you to know that I’m incredibly grateful for you. You’ve become such an essential part of my life, and I treasure every word, every conversation, every shared memory. I don’t know what the future holds for us, but today, I celebrate you. I celebrate us.\n\nThank you for being together with me. I love you more than words can express. I can’t wait to see what the next year of our love brings! \n\nHappy anniversary once again umzyy 🥺🩷",
    "created": 1746799910724000,
    "labels": [
      "Letters 💌"
    ],
    "category": "letters"
  },
  {
    "title": "Open when you're about to give up.",
    "text": "I hope and pray that you never feel the need to come here, but we're humans and we come across certain moments where we feel like giving up even on  things that  mattered the most to us at a point of time. \nI want to remind you that you're much capable of handling things on your own, you've always had! Things would definitely fall into place, just like you used to say \"dua aur sabr\" toh bs yahi yaqeen rakho sab thik ho jayega! \n\nAlso, any person or letter can't just perform a miracle and boom you start feeling better but yes God definitely can! So try to grow closer to Him. \nThere's a Bible verse in the book of Revelation that says \"What He opens, no one can shut\", so whatever has made you feel that burdened if it has a role to play in your life, then things will definitely work out, trust me! And if not me, then trust God! \n\nKnow that I love you and no matter what I'll be there to listen to you! 🩷",
    "created": 1746799910414000,
    "labels": [
      "Letters 💌"
    ],
    "category": "letters"
  },
  {
    "title": "Open when you're traveling alone.",
    "text": "If you’re reading this, it probably means you're on the move, maybe with those friends (your boyfriends), who take too many risks, or drag you into plans you didn’t fully think through. And maybe it's late. Maybe you're somewhere you promised you wouldn’t go. Maybe you're just trying to enjoy the moment but your mind is a little unsettled. Mine definitely is. 😏\n\nI’m not here to scold or control you. I trust your heart. 🤧\nBut I also care about your safety in ways that make me worry even when I don’t want to. You matter too much to me not to say this...\nPlease be careful. Please stay alert.\nDon’t follow the crowd just to avoid saying no. Your peace, your life, your well-being...they come first, always.\n\nI know you’re strong and smart and capable, but even the strongest need reminders sometimes, so here we're - \n\n🔪 Keep your phone charged.\n\n🔪 Stay close to people you actually trust.\n\n🔪 If something doesn’t feel right, don’t second \n      guess it... Leave! \n\n🔪 And if you're tired, rest. You're not missing out on   \n      anything worth more than your safety.\n\n🔪 Stay away from women other than your gf (Suvi).\n\n\nI may be far away, but that doesn’t stop me from thinking of you every moment. You're carrying a piece of my heart with you wherever you go. So carry it gently, okay? 🥺\n\nCome back safe. Come back whole. Come back to me. 🥺😭\nAlways waiting, always loving.🥺🩷\nYour suvi 🤧",
    "created": 1746799909168000,
    "labels": [
      "Letters 💌"
    ],
    "category": "letters"
  },
  {
    "title": "Open when you're feeling unmotivated.",
    "text": "It’s okay to feel like this. Everyone has those days, when nothing clicks, when the smallest tasks feel heavy, and when motivation seems to vanish. I know how strong and driven you usually are, so if you're feeling off right now, please don’t be too hard on yourself.\n\nYou’re allowed to rest. You’re allowed to slow down.\nThis moment doesn’t define you...it’s just a pause, not a full stop.\n\nEven when things might not seem going according to your plan, you’re still growing. You’re still becoming. Rest is part of the process, too. \n\nI believe in you...completely! 🩷 Not just when you're achieving, but also when you're struggling. You’ve come so far already, and I know you’ll find your rhythm again. Until then, be kind to yourself. Take a deep breath. Do one small thing, and let that be enough for today.\n\nAnd if you need a reminder,\nYou're capable. You're loved. And you're not alone in this. 😌🤧🩷\n\nI'm proud of you..always!!! 👀",
    "created": 1746799909154000,
    "labels": [
      "Letters 💌"
    ],
    "category": "letters"
  },
  {
    "title": "Open when you're sick.",
    "text": "I don't want you to open this ever 🤧 but we're humans and we all get sick, and especially you!! 😏 \nWhen you'd really be sick, you definitely won't have the energy to come here, but if you do, then you should know I'd probably be mad at you for being sick 😏😂  but I would still say that I’m so sorry you’re not feeling well right now. I wish I could be there to gently run my fingers through your hair, bring you nice food and sit beside you until you fell asleep. But since I can’t, this letter is my little way of being there for you, from across this distance! 🤧\n\nI know how often your body gets tired and how quickly you fall sick, and that’s why I worry because I care about you so deeply. If I could wrap you up in the softest blanket and take all the discomfort away, I would.\n\nRight now, you don’t need to do anything except rest. Let your body heal. Let yourself pause.  Know that you matter a lot to someone out there  who's waiting for you to heal. 🥺\n\nClose your eyes and imagine me right there beside you, whispering, \"Sb thik ho jayega Umzy, suvi hai na tmhare pass\" 🥺\nI’m proud of you for making it through even the tough days.\n\nTake your medicine. Drink something warm. Sleep when you can. And when you wake up, know that someone far away is holding you in their heart, gently and constantly.🩷\n\nFeel better soon, my love.\nYou're not alone, even when it feels like it. 🥺🩷",
    "created": 1746799909137000,
    "labels": [
      "Letters 💌"
    ],
    "category": "letters"
  },
  {
    "title": "Open when you need a laugh.",
    "text": "If you're opening this, I hope you're already smiling, because just thinking of you brings the biggest, goofiest grin to my face. 🤭\n\nBut okay, let’s be real…\nRemember those video calls where I couldn't stop smiling  when you used to sing for me or your half-asleep voice? 🫣\nOr when I'd randomly go \"I love you\" like ten times in a row, especially on those days when my hormones decided to turn me into a clingy love-struck mess? Yeah… that version of me was extra, but also very real. And you never once made me feel weird about it. You just behaved more obsessed than me and somehow I fell harder.😭🩷\n\nYou've seen me soft, sleepy, chatty, dramatic, and completely in love, and you say my smile is your favorite. So here I am, sending you some of that same energy back. 👀\n\nSo if today feels heavy, or if you're just tired of the world...pause. 🤧\nTake a deep breath.🥺\nSmile.🤭\nBecause I’m here, loving you from across the distance and saving up all my best smiles just for you.😌🤭\n\nYou’re my favorite laugh, my favorite call, my favorite comfort. 🩷\n\nNow go drink some water, send me a snap, and don’t do anything dumb.\n(Unless it’s something dumb with me.) 🫣",
    "created": 1746799909125000,
    "labels": [
      "Letters 💌"
    ],
    "category": "letters"
  },
  {
    "title": "Open when you're thinking about our future.",
    "text": "I don't know if I should be happy writing this or overwhelmed, cause \"you think of our future together\", sounds so good, but \"you think of our future and know that we might not be together\", hurts a lot! \nBut we're only going to think positively and believe in what we've asked for in prayers!\n\nI don't want you to be sad or anxious thinking about our future, if we're really in love, if we've really prayed for this, if we've been genuine with eachother, then God definitely has something in plan for us, cause meeting you (digitally), getting to know you, can't just go in vain, we've to make it work and we will 🥺  \n\nAnd I want a life with you like this picture above 😭 and I pray for it 🥺 \n\nI love you Umair please don't be sad 🥺🩷",
    "created": 1746799909120000,
    "labels": [
      "Letters 💌"
    ],
    "category": "letters"
  },
  {
    "title": "Open when you're celebrating something.",
    "text": "I hope and pray that you get to come here often! 👀\nI want you to celebrate every big or small achievement and celebrating doesn't mean eating out at KFC 😏\n\nI want you to be happy for yourself, be proud of yourself and love yourself the way you are! ",
    "created": 1746799909099000,
    "labels": [
      "Letters 💌"
    ],
    "category": "letters"
  },
  {
    "title": "Open when you need a reminder of your worth.",
    "text": "Every now and then I see you questioning your self worth and today if you're here, then it's one such day!\nEveryone of us are built like that we tend to look down upon us and that's totally fine until you start believing in it. \nAnd me being in love with you can't let you believe in something that's not even true, you have no idea how precious you are Umair! Not just to me but also to your family and your friends, they might not be that expressive about this but I'm sure that they too might be really proud of you. \n\nIt's not been long enough but I've known you inside out and I know your story, all I can see is a man who has gone through different sets of emotional turmoil but still has managed to work through it, who's well raised, who knows how to respect others, who tries his best not to hurt someone he cares about and there's so much more I just can't put them into words 😕\n\nYou put in so much effort working to build a future for yourself, your family, you're not reckless like any other boy in his early 20s, you're emotionally intelligent and available which is the most attractive thing a man can possess.\n\nYou have no idea your mere existence brings so much happiness to me, if you feel the same about me I pray that we continue to see each other this way. \n\nSo remember that if not anyone suvi will always be proud of you 🩷",
    "created": 1746799909084000,
    "labels": [
      "Letters 💌"
    ],
    "category": "letters"
  },
  {
    "title": "Open when we're in the middle of a fight.",
    "text": "I'm sorry that I made you come here, but I want you to read this when you feel that you don't want to talk to me anymore because that's when I want you to communicate the most! \nWe've had our arguments, we've also been in the verge of breaking up a lot of times but somehow we've always made up and today when you're here I want you to remind yourself of all those times when we've been happy and at peace because of each other. \n\nThink of the times when you know how happy your presence makes me, which in turn gives you happiness 🤧 And not just that, I need you to remember that how much I love you, and that is why I care and expect certain things, you should know that you matter a lot to me, and your nonchalant behaviour can hurt me, 'your suvi' (the one you wish to make the happiest) and I know you'd never want to do that, so please try to talk to me and understand my pov and I promise to behave all calm and understanding 😭",
    "created": 1746799909070000,
    "labels": [
      "Letters 💌"
    ],
    "category": "letters"
  },
  {
    "title": "Open when you're imagining our first meeting.",
    "text": "Only God knows if we ever get to meet in person or will things end even before I could see you right in your eyes, feel your skin against mine or even get a chance to breathe the same air as yours 🥺\n\nI don't have any idea as of now that how are things going to work out, I don't want to give up on us Umair, joh couples ke beech itne sare problems hote unko tak lgta hai ki sath reh kr sb thik ho jayega, just imagine how happy and at peace we both would be if we get to stay together 🥺 \n\nFew months back, every night, I used to imagine the very same image of us meeting at the airport and it would feel so overwhelming ki kya hi batayen 🤧 \nThe way I look for you in the crowd and the moment I find you and come running to you, we look into each other's eyes and pause for a minute or two, then come closer, we get emotional and hug each other, that one hug and it takes away all the pain, hardships and chaos we've dealth with! \nI start crying, you wipe my tears then we laugh later I take you to the cab, there you hold my hands for the first time, that feeling would be out of the world 🥺 we get into our hotel room or our home, we sit together, first at distance then slowly we come closer and then we never ever leave each other's company 😭 I want to be with you every single minute that's how much I love you! 🥺🩷\n\nI hope and pray that God listens to us. 🥺",
    "created": 1746799908861000,
    "labels": [
      "Letters 💌"
    ],
    "category": "letters"
  },
  {
    "title": "Open when you're stressed or overwhelmed.",
    "text": "Umair, I don’t know exactly what’s going on right now, that made you come here, maybe it’s stuff at home, worries about your career, or maybe you’re just not feeling your best. Whatever it is, I want you to know that it’s okay to feel overwhelmed sometimes. It doesn’t make you weak. It makes you human.\n\nI know you try to stay strong, especially for the people around you. But please don’t forget that you matter too. Your feelings, your peace, your health... all of it. You don’t have to carry everything on your own. 🥺\n\nIf it’s family stuff, I know how much you care and how hard it can be when things aren’t going right. Just remember, you can love people without draining yourself for them. It’s okay to take a step back when you need to.🤧\n\nIf it’s your career or your future stressing you out, just breathe. You don’t have to have all the answers right now. You’re doing your best, and that’s enough. One step at a time is still progress, even if it doesn’t always feel like it.\n\nAnd if it’s your health , I’m really hoping you’re taking care of yourself. Please don’t push your body too hard. Rest is important, and you’re allowed to slow down when you need to.\n\nYou’re not alone in this. I’m here. I believe in you. And I’m proud of you...not just for what you do, but for who you are.🥺🩷\n\nSo take a break, drink some water, maybe step outside for a bit, talk to me 🤧 You’ll be okay. I’ve got your back, always!! 🩷\n",
    "created": 1746799681802000,
    "labels": [
      "Letters 💌"
    ],
    "category": "letters"
  },
  {
    "title": "Open when you're angry or upset.",
    "text": "If you’re opening this, something’s weighing on your heart. Maybe you’re angry, maybe you're hurt… maybe I’ve said or done something again that I regret. I want you to know...I’m sorry. 🥺\n\nSometimes, I react too quickly. My anger gets loud, and I know it can hurt. But please believe me when I say, I never want to be the reason you feel unloved or distant.\n\nI don’t always know how to manage my emotions the right way, but I’m trying. I really am. You matter to me so much, and I hate the thought of causing you pain, especially when you're the one person I want to protect from it. 🤧\n\nSo, if I was harsh, if my words have hurt you I want you to remember this...I didn’t mean to hurt you. You don’t deserve that. And I’ll always come back, not just with apologies, but with the effort to grow and be better for you… for us.🤧\n\nPlease take your time. Cool down, breathe, do what you need. I’m not going anywhere.\n\nI love you 🥺🩷 even when I’m angry, even when you’re upset. Always. 🤧😭\n",
    "created": 1746799681802000,
    "labels": [
      "Letters 💌"
    ],
    "category": "letters"
  },
  {
    "title": "Open when you can't sleep.",
    "text": "If you're reading this, I’m guessing the night feels a little too long and your thoughts won’t leave you alone. I wish I could be right there beside you, talking you to sleep, running my fingers through your hair, and just making everything feel a little lighter. 🥺\n\nSince I can't be there physically, let me still remind you of a few things:\n\nYou’re safe. You’re loved. You’re on my mind, ALWAYS!!!! 🥺🩷\n\nClose your eyes for a second.Imagine me beside you. My hand in yours. My voice softly telling you how much I love you and how lucky I feel every single day to have you. If I could, I’d whisper the kind of things that make your heart feel full and your mind feel quiet.\n\nYou know how you sound when you're sleepy? That soft, low tone that makes me melt every single time? I’d do anything to hear it now. Maybe you'd be half-asleep and still trying to say something sweet, like you always do, and I’d be there smiling like an idiot because I love you so damn much!!!!! 😭\n\nTake a deep breath, close those beautiful eyes, and let the world fade for a while. You don’t need to carry anything tonight. Just rest. I’ll be right here...thinking of you, praying peace finds you, and loving you more with every beat of my heart.\n\nGoodnight my Umzy baby. You’ve got this. And I’ve got you. 🤧🩷",
    "created": 1746799681762000,
    "labels": [
      "Letters 💌"
    ],
    "category": "letters"
  },
  {
    "title": "Open when you want to know how much I love you.",
    "text": "If you've opened this right now, I hope you know it already, but in case you're looking for a reminder, let me spell it out for you 👀\n\nLoving you isn't just a feeling. It's something my heart naturally settles into....effortless, constant, and real. 🤧\n\nThere are moments I catch myself smiling at the thought of you. Not because of something you did, but simply because you exist. Your presence, even from miles away, has this quiet magic that calms every storm inside me. 🤧\nAnd your voice? God, don’t even get me started. It stays with me. Whether you're calm, excited, teasing me, or half-asleep—each version of it hits differently. Like, I could recognize your mood just from the way you say hello. Sometimes I replay your voice notes just to feel closer to you. It’s crazy how comforting and addictive it is at the same time. 🥺🩷😭\n\nAnd your eyes—those brown eyes. There’s just something about them. They’re warm, intense, and honestly way too pretty for someone who has no idea what kind of effect they have on me.😭🩷\n\nSometimes I sit still, trying to grasp how someone so far away can feel closer than anyone else. Your love, your way of loving is warmer than any touch. It’s the kind of love that makes me believe in soul connections, in timing, in prayers that somehow get answered just right. 🥺\n\nI love you not just for the way you make me feel, but for who you are. For how you listen. For how you care without needing a reason. For how you’ve quietly become a part of every tomorrow I look forward to. 🥺🩷\n\nYou are my calm, my chaos, my comfort, my craving all wrapped in one. 😭🩷\nSo whenever you question it, make sure to read this letter and remember: \n\nYou are loved more deeply than these words can ever capture. 🩷\n\nAlways yours,\nSuvi 🥺",
    "created": 1746799681471000,
    "labels": [
      "Letters 💌"
    ],
    "category": "letters"
  },
  {
    "title": "Open when you feel lonely.",
    "text": "If you're reading this, I know your heart is really feeling a sense of loneliness, which has made you sad! I wish so badly I could take that ache away.\nI know the distance feels especially heavy today but please remember this...you are not unloved, unseen, or forgotten. Not for a single second.🥺\n\nYou live in my thoughts all the time. I think about you in every quiet moment, every song that reminds me of you, every time I look at the moon and wonder if you're seeing it too. You are part of me now, in a way that defies logic or location.\n\nI know loneliness can make you wonder that you’re alone in this, or maybe I’ll drift away. But I need you to know with absolute certainty that I'm here. I'm staying. I'm loving you across every mile. 🥺🩷\n\nSo if the silence around you feels too loud tonight, close your eyes and imagine me there—holding your hand, leaning my head against yours, whispering, “You’ve got me. Always.” 🩷\n\nYou are never truly alone, love.\nNot while I’m breathing.🤧",
    "created": 1746799592173000,
    "labels": [
      "Letters 💌"
    ],
    "category": "letters"
  },
  {
    "title": "Open when you're having a bad day.",
    "text": "I just wish you never come here I don't want you to have such day, I wish more than anything that I could be there to hold your hand through it. Though we haven’t met  in person, and it's been just 8 months (till the day I'm writing this) but somehow, you’ve already become one of the most important people in my world.\n\nEven on the tough days...especially on the tough days...I want you to remember this, you are not alone. I’m out here thinking of you, cheering you on, praying for your peace. We may be miles apart, but I care for you a lot maybe more than people who are close to you 🥺\n\nYou don’t have to have it all figured out today. It’s okay to pause, cry, or even just sit in silence. What matters is that you keep going and you will, because I know your strength, even if you forget it sometimes.\n\nWhenever you're ready, look up. The sky we both share is still above you, and I'm under it too, loving you from a distance, until the day we finally meet.\n\nTake care of your heart today, for me and for you! 🥺🩷\n\n",
    "created": 1746799591023000,
    "labels": [
      "Letters 💌"
    ],
    "category": "letters"
  },
  {
    "title": "Open when you miss me.",
    "text": "Someone's missing me Haan 🤧👀\nIf you’ve opened this, it means you're really craving my presence, I wish I could just hold your hand or give you a hug or  rest my head on your shoulder right now. But since I can’t, let this letter do the work 🤧 \nClose your eyes for a second. Breathe and know that I’m right here with you, always.\n\nI know this isn’t easy. It’s hard to love from afar, to miss someone you've never even had the chance to meet face to face. But what we have… it’s real. It’s rare. And it matters. No distance or doubt can undo that.\n\nEvery message, every late-night talk, every shared dream, we’ve built something beautiful. \nI won’t lie, sometimes I also wonder what if we never meet. But then I remind myself, love isn’t always measured by time or touch. Sometimes, it’s in faith, in loyalty, in the choice to stay even when it’s hard.\n\nSo when you miss me, I hope you smile through the pain. I hope you remember how proud I am of you, how much you mean to me, and how deeply I care for you, even from afar!\n\nUntil the day we meet (if destiny allows), I’m holding onto you the best way I can, with my heart, my words, and my prayers!! 🥺\n",
    "created": 1746799591012000,
    "labels": [
      "Letters 💌"
    ],
    "category": "letters"
  },
  {
    "title": "Happy birthday Umzyy 🩷",
    "text": "Happy birthday love, I don't know where to start, there's lot of emotions and I won't be able to express them all but I'd try to put them into words as much as I can!\nSo the day we started talking I never thought you'd mean so much to me, that I'd find myself waiting with such excitement for your birthday! 👀\nAt first the only reason I added you was because your name was 'Umair' and I wanted to have an Umair in my followers list, I never thought we'd even talk like that! Our conversation flowed so smooth that I didn't even notice and you became a part of my daily routine, waiting for you to text or send me a reel so that I could drag that into a conversation felt amazinggg!!! It did make me feel restless back once (cause sometimes waiting wasn't easy) but then dheere dheere things worked out between us and on 10th of October we confessed 🤧 or let's say I made you do that 👀 since that very day my feelings for you have just grown stronger 🤧\n\nI know that us being an endgame seems like a dream but we don't really know what our future holds so for time being I'd just give you all the love I can! And who knows, together, with prayer, faith and patience we could make it! \n\nWell well let's not get emotional here 👀 I've  prepared something for you, it might not be the bestest gift one could receive but given the distance and halaat of our mulks this was the most I could do for you on this special day 🥺 Hope it'll make your day a little better 🤧\n\nHere are 22 letters, #Letters 💌  that I've written for you, (as you've turned 22) each other based on different emotions/situations! \n\nAlso, you often keep asking me, \"Why me? kya hai aisa hm me\" \"Kyu krti hai hmse itna pyaar?\" and more such questions, so I'll be telling you 22 such reasons why I love you. There are a lot more reasons, which I won't even be able to pen down but I've managed to put 22 of them into words, so that you know how special you're to me! \nFind these in #Reasons ❤️‍🩹 \n\nI've also attached the poems that I'd written for you earlier. #Poems 🖇️ \n\nYou can go to the labels and find them! \nHope you'd like it! 😭\nHappy birthday once again and I love you! 🥺🩷\n\n",
    "created": 1746793816839000,
    "labels": [
      "Letters 💌",
      "Poems 🖇️",
      "Reasons ❤️‍🩹"
    ],
    "category": "letters"
  },
  {
    "text": "Your laugh is my favorite sound.",
    "category": "reasons",
    "created": 0
  },
  {
    "text": "The way you scrunch your nose when you're thinking.",
    "category": "reasons",
    "created": 0
  },
  {
    "text": "How you always support my dreams.",
    "category": "reasons",
    "created": 0
  },
  {
    "text": "Your kindness to strangers.",
    "category": "reasons",
    "created": 0
  },
  {
    "text": "The way you look at me.",
    "category": "reasons",
    "created": 0
  },
  {
    "text": "Our late night video calls.",
    "category": "reasons",
    "created": 0
  },
  {
    "text": "Your amazing taste in music.",
    "category": "reasons",
    "created": 0
  },
  {
    "text": "How hard you work.",
    "category": "reasons",
    "created": 0
  },
  {
    "text": "Your warm hugs (even virtual ones feel warm).",
    "category": "reasons",
    "created": 0
  },
  {
    "text": "Just being you.",
    "category": "reasons",
    "created": 0
  }
]